## ----setup, include=FALSE------------------------------------------------
knitr::opts_chunk$set(echo = TRUE)

## ------------------------------------------------------------------------
library("cbr")

## ------------------------------------------------------------------------
# котировки на 14 июня 2016 года
currency <- cbr_cur_ondate(ondate = "2016-06-14")
head(currency)

## ------------------------------------------------------------------------
# динамика котировки бурундийского франка (R01120) за указанный период
currency <- cbr_currency(currency = "R01120", from = "1993-01-05", to = "2013-09-18")
head(currency)

## ------------------------------------------------------------------------
# динамика сведений за указанный период
balances <- cbr_balances(from = "2007-01-01", to = "2013-01-01")
head(balances)

## ----echo=FALSE----------------------------------------------------------
data("cbr_requests")
cbr_requests

## ------------------------------------------------------------------------
repo <- cbr_security_info("RepoSessionXML")
head(repo)

## ------------------------------------------------------------------------
# сделаем дату в нормальном формате
repo[, "D0"] <- as.Date(as.POSIXct(repo[, "D0"])) + 1
# оставим один знак после запятой
repo[, 2:length(names(repo))] <- apply(repo[, 2:length(names(df))], 1, as.numeric)
# обновим названия переменных
names(repo) <- c("Date", "1dayRate", "1dayVolume", "1weekRate", "1weekVolume")
head(repo)

